Configuration/ChartsOfCharacteristicTypes/бит_ум_ДополнительныеПараметрыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>бит_ум_ДополнительныеПараметрыПечати</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:Type>cfg:EnumRef.бит_ум_ПричинаИзмененияСведений</v8:Type>
				<v8:Type>cfg:CatalogRef.Должности</v8:Type>
				<v8:Type>cfg:EnumRef.бит_ум_ПричинаВыдачиДубликата</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.бит_ум_ОснованияДляРаботыБезРазрешения</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.бит_ум_ЗначенияПараметровПечати</v8:Type>
				<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>999</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автозаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Configuration/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/ChartsOfCharacteristicTypes/бит_ум_ДополнительныеПараметрыПечати/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов.
//
// Возвращаемое значение:
//   Массив - список имен реквизитов объекта.
//
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	НеРедактируемыеРеквизиты.Добавить("*");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение параметров печати.
//
Процедура НачальноеЗаполнение() Экспорт
	
	// План видов характеристик "Дополнительные параметры печати"
	
	КлассификаторТаблица = ТаблицаКлассификатора("ПараметрыПечати");
	
	Порядок = 0;
	
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		
		Порядок = Порядок + 1;
		
		ЭлементСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати." + СтрокаКлассификатора.ПараметрПечати);
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		ЭлементОбъект.ИмяПараметра = СтрокаКлассификатора.ПараметрПечати;
		ЭлементОбъект.РеквизитДопУпорядочивания = Порядок;
		ЭлементОбъект.ПолеАдреса = СтрокаКлассификатора.ПолеАдреса = "1";
		
		Если ЭлементОбъект.ИмяПараметра = "ДатаРазрешенияРаботодателю" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Разрешение на прием иностранцев дата выдачи'"), 
					НСтр("ru = 'Дата выдачи разрешения на привлечение и использование иностранных работников'"),
					"Справочник_Организации", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "НомерРазрешенияРаботодателю" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Разрешение на прием иностранцев №'"), 
					НСтр("ru = 'Номер разрешения на привлечение и использование иностранных работников'"),
					"Справочник_Организации", ОбщегоНазначения.ОписаниеТипаСтрока(15));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "СвидетельствоОГосударственнойРегистрацииДата" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о государственной регистрации дата выдачи'"), 
					НСтр("ru = 'Дата выдачи свидетельства о государственной регистрации'"),
					"Справочник_Организации", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "СвидетельствоОГосударственнойРегистрацииСерияНомер" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о государственной регистрации серия и №'"), 
					НСтр("ru = 'Серия и номер свидетельства о государственной регистрации'"),
					"Справочник_Организации", ОбщегоНазначения.ОписаниеТипаСтрока(15));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "СвидетельствоОПостановкеНаУчетВНалоговойДата" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о постановке на учет в налоговом органе дата'"), 
					НСтр("ru = 'Дата выдачи свидетельства о постановке на учет в налоговом органе'"),
					"Справочник_Организации", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "СвидетельствоОПостановкеНаУчетВНалоговойСерияНомер" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о постановке на учет в налоговом органе серия и №'"), 
					НСтр("ru = 'Серия и номер свидетельства о постановке на учет в налоговом органе'"),
					"Справочник_Организации", ОбщегоНазначения.ОписаниеТипаСтрока(15));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "КонтрагентСвидетельствоОПостановкеНаУчетВНалоговойДата" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о постановке на учет в налоговом органе дата'"), 
					НСтр("ru = 'Дата выдачи свидетельства о постановке на учет в налоговом органе'"),
					"Справочник_Контрагенты", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "КонтрагентСвидетельствоОПостановкеНаУчетВНалоговойСерияНомер" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о постановке на учет в налоговом органе серия и №'"), 
					НСтр("ru = 'Серия и номер свидетельства о постановке на учет в налоговом органе'"),
					"Справочник_Контрагенты", ОбщегоНазначения.ОписаниеТипаСтрока(15));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "КонтрагентСвидетельствоОГосударственнойРегистрацииДата" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о государственной регистрации дата выдачи'"), 
					НСтр("ru = 'Дата выдачи свидетельства о государственной регистрации'"),
					"Справочник_Контрагенты", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
			КонецЕсли;
				
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "КонтрагентОГРН" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'ОГРН'"), 
					НСтр("ru = 'Для юридических лиц — основной государственный регистрационный номер в Едином государственном реестре юридических лиц, для индивидуальных
                          |предпринимателей — основной государственный регистрационный номер в Едином государственном реестре индивидуальных предпринимателей'"),
					"Справочник_Контрагенты", ОбщегоНазначения.ОписаниеТипаСтрока(15));
			КонецЕсли;
		ИначеЕсли ЭлементОбъект.ИмяПараметра = "КонтрагентСвидетельствоОГосударственнойРегистрацииСерияНомер" Тогда
			Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка")) Тогда
				ЭлементОбъект.Свойство = НайтиДополнительныйРеквизит(
					НСтр("ru = 'Свидетельство о государственной регистрации серия и №'"), 
					НСтр("ru = 'Серия и номер свидетельства о государственной регистрации'"),
					"Справочник_Контрагенты", ОбщегоНазначения.ОписаниеТипаСтрока(15));
			КонецЕсли;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлементОбъект);		
		
	КонецЦикла;
	
	// Справочник "Дополнительные значения параметров печати"
	
	КлассификаторТаблица = ТаблицаКлассификатора("ЗначенияПараметровПечати");
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		ЭлементСправочникаПоОписанию(СтрокаКлассификатора);
	КонецЦикла;		

КонецПроцедуры

Процедура ЭлементСправочникаПоОписанию(СтрокаКлассификатора)
	
	ДополнительныйПараметрПечати = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати." + СтрокаКлассификатора.ПараметрПечати);
	
	Если ДополнительныйПараметрПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СправочникСсылка = Справочники.бит_ум_ЗначенияПараметровПечати.НайтиПоНаименованию(СтрокаКлассификатора.Значение, Истина, , ДополнительныйПараметрПечати);
	
	Если СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.бит_ум_ЗначенияПараметровПечати.СоздатьЭлемент();
		СправочникОбъект.Наименование = СтрокаКлассификатора.Значение;
		СправочникОбъект.Владелец = ДополнительныйПараметрПечати;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	КонецЕсли;
		
КонецПроцедуры

Функция ТаблицаКлассификатора(Классификатор)
	
	КлассификаторXML = ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.ПолучитьМакет(Классификатор).ПолучитьТекст();
	Возврат ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
КонецФункции

Функция НайтиДополнительныйРеквизит(Наименование, Описание, НаборИмя, ТипЗначения)
	
	Набор = Неопределено;
	Если Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.Реквизиты.Найти("ИмяПредопределенногоНабора") <> Неопределено Тогда
		Набор = УправлениеСвойствами.НаборСвойствПоИмени(НаборИмя);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Набор) Тогда
		Набор = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.НаборыДополнительныхРеквизитовИСведений." + НаборИмя);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("НаборСвойств", Набор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &Наименование
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЭлементСсылка = Выборка.Ссылка;
		
	Иначе
	
		НаименованиеНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Набор, "Наименование");
	
		ЭлементОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		ЭлементОбъект.Заголовок = Наименование;
		ЭлементОбъект.Наименование = ЭлементОбъект.Заголовок + " (" + НаименованиеНабора + ")";
		ЭлементОбъект.НаборСвойств = Набор;
		ЭлементОбъект.ТипЗначения = ТипЗначения;
		ЭлементОбъект.Подсказка = Описание;
		ЭлементОбъект.Доступен = Истина;
		ЭлементОбъект.Виден = Истина;
	
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлементОбъект);
	
		ЭлементСсылка = ЭлементОбъект.Ссылка;
		
	КонецЕсли;
	
	ОбъектНаборСвойств = Набор.ПолучитьОбъект();
	ТабличнаяЧасть = ОбъектНаборСвойств.ДополнительныеРеквизиты;
	НайденнаяСтрока = ТабличнаяЧасть.Найти(ЭлементСсылка, "Свойство");
	Если НайденнаяСтрока = Неопределено Тогда
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		НоваяСтрока.Свойство = ЭлементСсылка;
		ОбъектНаборСвойств.Записать();
	КонецЕсли;
	
	Возврат ЭлементСсылка;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
